{
	"O mnie": "About",
	"Zgadywanie kolorów": "Color guessing game",
	"Oczekiwanie na decyzję, czy coś jeszcze zmienić": "Waiting for decision if I should change something",
	"SyberyjskieCudo to projekt o który poprosili bardzo dobrzy przyjaciele, którzy prowadzą hodowlę kotów syberyjskich. Tak jak JW Society był już prawie gotowy w PHP, ale podczas nauki na wolnych lekcjach w szkole The Web Developer Bootcamp dostosowałem go pod Node.js i MongoDB. W nowej wersji pojawił się między innymi dostosowany kolor statusu do jego wartości. Ostatnio dodałem zmiany - zmieniłem tło, dodałem wsparcie do angielskiego języka i przebudowalem model w bazie danych dzięki czemu można było dodać dzieci u rodziców.": "SyberyjskieCudo is a project about which my very good friends asked. They have syberian cats breeding. Like JW Society was pretty read in PHP, but after learning on free lessons at school The Web Developer Bootcamp course I customised it to Node.js and MongoDB. In the newest version I added some changes including customised color of status to its value. Recently I added new background, support for English language and rebuilded database model so I could make children in parents template.",
	"Galeria": "Gallery",
	"Nie mam żadnych zdjęć do": "I do not have any photos to",
	"Czym się zajmuję": "What I do",
	"Piszę od podstaw strony internetowe": "I write websites from scratch",
	"Zajmuję się zarówno backendem jak i frontendem": "I do backend and frontend",
	"Jakie technologie wykorzystuję": "What technologies I use",
	"Różne moduły npm": "Different npm modules",
	"Moje projekty": "My projects",
	"Nazywam się Maciej Kuta. Mam 18 lat. Jestem jednym z ponad 8,5 miliona Świadków Jehowy. Uczę się w Zespole Szkół Politechnicznych w Głogowie w kierunku technik informatyk. Aktualnie jestem w 3 klasie. Moje hobby to pisanie stron internetowych i muzyka. Swoją przygodę z programowaniem zacząłem gdzieś około 3-4 lata temu od nauki Javy. Niestety język był za trudny i się poddałem. Dwa lata później mój brat polecił mi, by zacząć naukę od HTML i to już było łatwe polubiłem to. Zrobiłem parę kursów na Codecademy, a potem The Web Developer Bootcamp w wolnym czasie, który skończyłem niedawno. Ale od zawsze podstawą do nauki programowania było napisanie takiej aplikacji jak JW Society.": "I am Maciej Kuta. I am 18 years old. I am one of 8,5 million Jehovahs Witnesses. I'm learning at Zespol Szkół Politechnicznych in Głogow in IT tehnician direction. Now I'm in 3rd class. My hobbies are writing websites and music. I started my programming adventure 3-4 years ago by learning Java. Unfortunately this language was too hard and I gave up. Two years later my brother recommended me to start learning from HTML and it was easy, I liked it. I did several courses on Codecademy and then in free time The Web Developer Bootamp which I ended recently. But from the beginning my motivation to programming was to write an app like JW Society.",
	"Osiągnięcia": "Achievements",
	"Ukończenie kursu The Web Developer Bootcamp": "Completing The Web Developer Bootcamp course",
	"Projekty": "Projects",
	"Danmag jest projektem, który nie zrobiłem podstaw, ale po prostu zaktualizowałem. Poprzednią wersję można znaleźć na danmag.pl. Moim celem było zrobienie strony responsywnej, dostosowanej do wszystkic": "Danmag is not a project I did from scratch, but only updated. Previous version you can find on danmag.pl. My goal was to do responsive, intuitive website, good for all devices",
	"Czytaj więcej": "Read more",
	"SyberyjskieCudo to projekt o który poprosili bardzo dobrzy przyjaciele, którzy prowadzą hodowlę kotów syberyjskich. Tak jak JW Society był już prawie gotowy w PHP, ale podczas nauki na wolnych lekcjac": "SyberyjskieCudo is a project about which my very good friends asked. They have syberian cats breeding. Like JW Society was pretty read in PHP, but after learning on free lessons",
	"JW Society to aplikacja internetowa robiona głównie z myślą o moich braciach i siostrach z całego świata. Łączy w sobie Messenger, Kalendarz i w przyszłej aktualizacji Ministry Assistant. Zrobiłem rów": "JW Society is web app which I do mainly for my brothers and sisters around the world. It connects Messenger, Calendar and in future update Ministry Assistant. I did also",
	"Oczekiwanie na decyzję czy wprowadzić zmiany": "Waiting for decision if make changes",
	"Danmag jest projektem, który nie zrobiłem podstaw, ale po prostu zaktualizowałem. Poprzednią wersję można znaleźć na danmag.pl. Moim celem było zrobienie strony responsywnej, dostosowanej do wszystkich urządzeń oraz, żeby była bardziej przejrzysta, ponieważ w poprzedniej wersji często było w jednym miejscu za dużo elementów i użytkownik nie wiedział na czym się skupić. Ostatnio dodałem poprawki błędów np. wyświetlanie głównych zdjęć w na górze karty oraz stopkę": "Danmag is not a project I did from scratch, but only updated. Previous version you can find on danmag.pl. My goal was to do responsive, intuitive website, good for all devices, because in previous version often user could not decide on what to look, it wass too many elements in one place. Recently I added fixes- displaying images at the top of card and footer.",
	"Zostały poprawki i testy": "Just fixes and tests",
	"Nie mam jeszcze gotowego linku do projektu": "I do not have any ready link to this project",
	"JW Society to aplikacja internetowa robiona głównie z myślą o moich braciach i siostrach z całego świata. Łączy w sobie Messenger, Kalendarz i w przyszłej aktualizacji Ministry Assistant. Zrobiłem również dodatek Duchowe Skarby, gdzie bracia będą mogli się podzielić z innymi jakimś skarbem z Biblii czy z zebrania lub z jakiejś publikacji. Aplikacja była już prawie gotowa, ale po nauczeniu się nowych technologii na The Web Developer Bootcamp zacząłem przerabiać pod Node.js. W nowej wersji pojawiły się profile, gdzie dany brat i siostra może podzielić się jak poznał prawdę. Pojawiło się również edytowanie i usuwanie wydarzeń, to samo ze skarbami duchowymi, nowy wygląd kalendarza, skarbów duchowych oraz wyszukiwania przyjaciół oraz wiele innych.  Niedawno zrobiłem system powiadomień, jeszcze zostały różne poprawki, zapomniałem hasło i różne poprawki w stylach w kalendarzu i skarbach duchowych. Również pojawiło się wyszukiwanie wydarzeń.": "JW Society is web app which I do mainly for my brothers and sisters around the world. It connects Messenger, Calendar and in future update Ministry Assistant. I did also Spiritual Gems additional where brothers could share some gem from Bible, meeting or publication. App was pretty ready, but I learned new technologies on The Web Developer Bootcamp course I started customised it to Node.js. In newest version I added profiles where brother/sister can share how they got know the truth, editing and deleting events, spiritual gems, new design of calendar, spiritual gems, searching friends and many more. Recently I did notification system, searching events. I hae to do just some fixes in notification system.",
	"Ostatnie 3 projekty": "Last 3 projects",
	"Zobacz moje ostatnie projekty": "See my last projects",
	"Polski": "Polish",
	"Angielski": "English",
	"Języki": "Languages",
	"Zostało resetowanie hasła, dodawanie zdjęć na serwer, profile": "Just password reset, uploading pictures to server and profiles",
	"BrainOnFire to projekt, który robię dla mojej przyjaciółki. Prowadzi ona bloga, gdzie dzieli się radami na temat tego jak radzić sobie z depresją i trochę o swoim życiu. Aktualnie dopracowuję bloga. N": "BrainOnFire is a project I do for my friend. She writes blog about how to deal with depression and about her life. Actually I am making blog better and better.",
	"Edytuj opinię o projekcie": "Edit review about",
	"Wyloguj": "Log out",
	"Edytuj ocenę": "Edit rating",
	"Edytuj opinię": "Edit review",
	"Wpisz opinię": "Write a review",
	"Opinie o": "Reviews about",
	"Dodaj opinię": "Add review",
	"Edytuj": "Edit",
	"Usuń": "Delete",
	"Nikt na razie nie dodał opinii o projekcie": "No one have added review yet to",
	"Zaloguj się do": "Log in to",
	"Nazwa użytkownika": "Username",
	"Hasło": "Password",
	"Zaloguj się": "Log in",
	"Zarejestruj się na": "Register to",
	"Zarejestruj się": "Register",
	"Dodaj opinię o projekcie": "Add review about",
	"Ocena": "Rating",
	"Opinia": "Review",
	"Witaj ": "Welcome ",
	" na moim portfolio": " on my portfolio",
	"BrainOnFire to projekt, który robię dla mojej przyjaciółki. Prowadzi ona bloga, gdzie dzieli się radami na temat tego jak radzić sobie z depresją i trochę o swoim życiu. Aktualnie dopracowuję bloga. Niedługo w sekcji link umieszczę linka do jednego z jej dotychczasowych postów": "BrainOnFire is a project I do for my friend. She writes blog about how to deal with depression and about her life. Actually I am making blog better and better. Soon I will put a link in link section to her foregoing post.",
	"Prosimy zaloguj się najpierw": "Please log in first",
	"Nie masz konta? Zarejestruj się": "You do not have an account? Create it",
	"Witaj na moim portfolio!": "Welcome on my portfolio!",
	"Używam plików cookies (tzw.ciasteczek), by poprawić jakość używania strony. Przez kliknięcie x zgadzasz się na zbieranie danych. Masz możliwość wyłączenia ich w przeglądarce.": "I use cookies to enhance your expierence. By clicking x you agree to use cookies. You can also turn it off in the browser",
	"Wesprzyj": "Support",
	"dse": "dse",
	"Strona dla przyjaciółdsadsaasdsd": "Strona dla przyjaciółdsadsaasdsd",
	"Oczekiwanie na zaakceptowanie projektu przez przyjaciół": "Oczekiwanie na zaakceptowanie projektu przez przyjaciół",
	"Ostatnia aktualizacja": "Last updated",
	"heheszki": "heheszki",
	"Nie mam żadnych osiągnięć": "Nie mam żadnych osiągnięć",
	"Oprócz programowania bardzo lubię muzykę": "Except for programming I like music so much",
	"Gram na instrumentach - gitara akustyczna i keyboard": "I play on instruments - acoustic guitar and keyboard",
	"Ulubione piosenki": "Favourites songs",
	"ew": "ew",
	"Zostaje u nas": "Zostaje u nas",
	"tets": "tets",
	"ss": "ss",
	"sggs": "sggs",
	"sa": "sa",
	"Nieskończone": "Not ended",
	"Oczekujące": "Awaiting",
	"Skończone": "Ended",
	"Portfolio v2 - dziennik zmian": "Portfolio v2 - changelog",
	"Dodana wartość o nazwie type do modelu projektu": "Added type value for project model in database",
	"Jeśli klikniesz na zdjęcie główne, a projekt ma gotowy link, przeniesie Cię do danej strony (BrainOnFire do ostatniego postu)": "If you click on project photo and it has ready link, it will redirect you to project page (BrainOnFire to latest post)",
	"Teraz od razu wiesz jaki jest status projektu - spojrzyj na dolną linię pod obrazkiem": "You know about project status on main page now - just look onto main photo bottom border",
	"Projekty dla parametru": "Projects for parameter",
	"Nie mam dostępnych projektów dla parametru": "I do not have any available projects for parameter"
}